robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
/**
  * @file   main.c
  * @brief  O3 Bootloader
  *
  *  Behaviour:
  *    1. Minimal HW init (clocks, GPIO).
  *    2. If BOOT_USB_FS_MOUNT_TEST is enabled, run USB file access test.
  *    3. Check for a valid application at APP_BASE (0x08020000).
  *    4. If valid  → jump to the application.
  *    5. If invalid → blink LED and wait in recovery loop.
  */

#include "stm32u5xx_hal.h"
#include "main.h"
#include "boot_jump.h"
#include "boot_flash.h"
#include "boot_ospi.h"
#include "usb_msc_service.h"
#include "usb_fs_service.h"
#include "usb_update.h"
#include "ff.h"
#include <stdio.h>
#include <string.h>


/* -----------------------------------------------------------------------
 * Private function prototypes
 * ----------------------------------------------------------------------- */
static void SystemPower_Config(void);
static void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void Recovery_Loop(void);
static void Boot_RunStartupPolicy(void);
static void ReadBinChunkedTest(const char *bin_path, uint32_t expected_crc32);
static void FlashAppIntTest(uint32_t expected_crc32);
static void FlashAppOspiTest(uint32_t expected_crc32);
static void UsbFsMountTestLoop(void);

#define BOOT_FORCE_INVALID_APP_FOR_TEST   0U
#define BOOT_USB_FS_MOUNT_TEST            1U
#define BOOT_FLASH_JUMP_AFTER_PROGRAM     0U  /* Set to 1 to jump to app after flash test */

/* Chunked read configuration */
#define CHUNKED_READ_BLOCK_SIZE           1048576U /* bytes per open/read/close cycle */
#define CHUNKED_READ_MAX_RETRIES          20U      /* retries per block on failure    */
#define CHUNKED_READ_INTER_BLOCK_DELAY_MS 500U     /* pause between blocks            */

/* Single shared IO buffer — used by ReadBinChunkedTest, FlashAppIntTest and FlashAppOspiTest.
 * These functions never run concurrently so one buffer is sufficient. */
static uint8_t io_buf[CHUNKED_READ_BLOCK_SIZE];

int _write(int file, char *ptr, int len)
{
    int i;

    (void)file;

    for (i = 0; i < len; i++)
    {
        ITM_SendChar(*ptr++);
    }

    return len;
}

/* -----------------------------------------------------------------------
 * main
 * ----------------------------------------------------------------------- */
int main(void)
{
    /* 1 — HAL and system init */
    HAL_Init();
    __HAL_RCC_PWR_CLK_ENABLE();
    SystemPower_Config();
    if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE2) != HAL_OK)
    {
        Error_Handler();
    }
    SystemClock_Config();
    MX_GPIO_Init();

    printf("BL start\n");

#if BOOT_USB_FS_MOUNT_TEST
    UsbFsMountTestLoop();
#endif

    Boot_RunStartupPolicy();

    /* Should never reach here */
    while (1) {}
}

/* -----------------------------------------------------------------------
 * Recovery_Loop
 *   Blink the status LED to signal that no valid application was found.
 * ----------------------------------------------------------------------- */
static void Recovery_Loop(void)
{
    uint32_t last_blink = HAL_GetTick();

    while (1)
    {
        if ((HAL_GetTick() - last_blink) >= 250U)
        {
            last_blink = HAL_GetTick();
            HAL_GPIO_TogglePin(BOOT_LED_GPIO_Port, BOOT_LED_Pin);
        }
    }
}

static void Boot_RunStartupPolicy(void)
{
    uint8_t app_valid;

    app_valid = (uint8_t)Boot_IsApplicationValid(APP_BASE);

#if BOOT_FORCE_INVALID_APP_FOR_TEST
    printf("[BOOT] TEST MODE: forcing application invalid\n");
    app_valid = 0U;
#endif

    if (app_valid != 0U)
    {
        printf("[BOOT] Valid app found -> jump\n");
        Boot_JumpToApplication(APP_BASE);
    }

    printf("[BOOT] No valid app -> recovery loop\n");
    Recovery_Loop();
}

/* CRC32 IEEE 802.3 using STM32 hardware CRC peripheral.
 * crc32_update(0, buf, len) calculates from scratch.
 * crc32_update(prev, buf, len) accumulates (prev must come from a previous call). */
static CRC_HandleTypeDef hcrc;
static uint8_t hcrc_initialized = 0U;

static void crc32_hw_init(void)
{
    if (hcrc_initialized != 0U)
    {
        return;
    }

    __HAL_RCC_CRC_CLK_ENABLE();

    hcrc.Instance                     = CRC;
    hcrc.Init.DefaultPolynomialUse    = DEFAULT_POLYNOMIAL_ENABLE;
    hcrc.Init.DefaultInitValueUse     = DEFAULT_INIT_VALUE_ENABLE;
    hcrc.Init.InputDataInversionMode  = CRC_INPUTDATA_INVERSION_BYTE;
    hcrc.Init.OutputDataInversionMode = CRC_OUTPUTDATA_INVERSION_ENABLE;
    hcrc.InputDataFormat              = CRC_INPUTDATA_FORMAT_BYTES;

    if (HAL_CRC_Init(&hcrc) == HAL_OK)
    {
        hcrc_initialized = 1U;
    }
}

static uint32_t crc32_update(uint32_t crc, const uint8_t *buf, uint32_t len)
{
    uint32_t raw;

    crc32_hw_init();

    if (crc == 0U)
    {
        raw = HAL_CRC_Calculate(&hcrc, (uint32_t *)buf, len);
    }
    else
    {
        raw = HAL_CRC_Accumulate(&hcrc, (uint32_t *)buf, len);
    }

    return raw ^ 0xFFFFFFFFU;
}

/* Lee un .bin completo mediante open/seek/read/close por cada bloque.
 * En caso de fallo, ejecuta un restart USB completo antes de reintentar. */
static void ReadBinChunkedTest(const char *bin_path, uint32_t expected_crc32)
{
    uint8_t * const chunk = io_buf;
    UsbFsResult_t   result;
    uint32_t        file_size   = 0U;
    uint32_t        offset      = 0U;
    uint32_t        bytes_read;
    uint32_t        to_read;
    uint32_t        crc         = 0U;
    uint32_t        block_num   = 0U;
    uint32_t        retry;
    uint32_t        total_retries = 0U;
    uint32_t        t_start;

    result = UsbFsService_GetFileSize(bin_path, &file_size);
    if (result != USB_FS_RESULT_OK)
    {
        printf("[CHUNK] %s GetFileSize FAILED result=%u\n",
               bin_path, (unsigned int)result);
        return;
    }

    printf("[CHUNK] %s size=%lu  block=%u  blocks=%lu\n",
           bin_path,
           (unsigned long)file_size,
           (unsigned int)CHUNKED_READ_BLOCK_SIZE,
           (unsigned long)((file_size + CHUNKED_READ_BLOCK_SIZE - 1U) / CHUNKED_READ_BLOCK_SIZE));

    t_start = HAL_GetTick();

    while (offset < file_size)
    {
        to_read = file_size - offset;
        if (to_read > CHUNKED_READ_BLOCK_SIZE)
        {
            to_read = CHUNKED_READ_BLOCK_SIZE;
        }

