robsanchez3/03_bootloader/STM32CubeIDE/Src/main.c
        /* Verify chunk immediately */
        flash_result = BootFlash_Verify(APP_BASE + offset, chunk, bytes_read);
        if (flash_result != BOOT_FLASH_OK)
        {
            printf("[FTEST] verify FAILED at offset=%lu\n", (unsigned long)offset);
            return;
        }

        offset += bytes_read;
        block_num++;

        printf("[FTEST] %lu / %lu bytes (%lu%%)\n",
               (unsigned long)offset,
               (unsigned long)file_size,
               (unsigned long)((offset * 100U) / file_size));

        if (offset < file_size)
        {
            HAL_Delay(CHUNKED_READ_INTER_BLOCK_DELAY_MS);
        }
    }

    uint32_t elapsed = HAL_GetTick() - t_start;

    /* 4. CRC32 over flash */
    {
        uint32_t crc_flash = 0U;
        crc_flash = crc32_update(crc_flash, (const uint8_t *)APP_BASE, file_size);

        printf("[FTEST] flash CRC32=%08lX  expected=%08lX  %s\n",
               (unsigned long)crc_flash,
               (unsigned long)expected_crc32,
               (crc_flash == expected_crc32) ? "MATCH" : "MISMATCH");
    }

    /* 5. Validate app image */
    printf("[FTEST] Boot_IsApplicationValid: %s\n",
           Boot_IsApplicationValid(APP_BASE) ? "VALID" : "INVALID");

    printf("[FTEST] done in %lu ms\n", (unsigned long)elapsed);

#if BOOT_FLASH_JUMP_AFTER_PROGRAM
    if (Boot_IsApplicationValid(APP_BASE))
    {
        printf("[FTEST] jumping to app...\n");
        UsbFsService_Unmount();
        UsbMscService_SetEnabled(0U);
        HAL_Delay(100U);
        Boot_JumpToApplication(APP_BASE);
    }
#endif
}

/* Lee app_ospi.bin por chunks desde USB, graba en OSPI flash y verifica con CRC32. */
static void FlashAppOspiTest(uint32_t expected_crc32)
{
    uint8_t * const chunk = io_buf;
    UsbFsResult_t  result;
    BootOspiResult_t ospi_result;
    uint32_t       file_size = 0U;
    uint32_t       offset    = 0U;
    uint32_t       bytes_read;
    uint32_t       to_read;
    uint32_t       retry;
    uint32_t       block_num = 0U;
    uint32_t       t_start;

    printf("[OTEST] === Flash app_ospi.bin test ===\n");

    /* 1. Init OSPI */
    ospi_result = BootOspi_Init();
    if (ospi_result != BOOT_OSPI_OK)
    {
        printf("[OTEST] OSPI init FAILED result=%u\n", (unsigned int)ospi_result);
        return;
    }

    /* 2. Get file size */
    result = UsbFsService_GetFileSize(USB_UPDATE_APP_OSPI_BIN, &file_size);
    if (result != USB_FS_RESULT_OK)
    {
        printf("[OTEST] GetFileSize FAILED result=%u\n", (unsigned int)result);
        return;
    }
    printf("[OTEST] file size=%lu bytes\n", (unsigned long)file_size);

    /* 3. Erase OSPI sectors */
    printf("[OTEST] erasing OSPI flash...\n");
    ospi_result = BootOspi_Erase(file_size);
    if (ospi_result != BOOT_OSPI_OK)
    {
        printf("[OTEST] erase FAILED result=%u\n", (unsigned int)ospi_result);
        return;
    }

    /* 4. Read from USB and program chunk by chunk */
    printf("[OTEST] programming OSPI flash...\n");
    t_start = HAL_GetTick();

    while (offset < file_size)
    {
        to_read = file_size - offset;
        if (to_read > CHUNKED_READ_BLOCK_SIZE)
        {
            to_read = CHUNKED_READ_BLOCK_SIZE;
        }

        /* Read chunk from USB with retry + recovery */
        bytes_read = 0U;
        for (retry = 0U; retry <= CHUNKED_READ_MAX_RETRIES; retry++)
        {
            result = UsbFsService_ReadFile(USB_UPDATE_APP_OSPI_BIN, chunk, offset, to_read, &bytes_read);
            if (result == USB_FS_RESULT_OK)
            {
                break;
            }
            if (retry < CHUNKED_READ_MAX_RETRIES)
            {
                printf("[OTEST] read offset=%lu RETRY %lu/%u -> recovery\n",
                       (unsigned long)offset,
                       (unsigned long)(retry + 1U),
                       (unsigned int)CHUNKED_READ_MAX_RETRIES);

                UsbFsService_Unmount();
                UsbMscService_ForceRestart();
                {
                    uint32_t t_wait = HAL_GetTick();
                    while (UsbMscService_IsReady() == 0U)
                    {
                        UsbMscService_Process();
                        if ((HAL_GetTick() - t_wait) > 10000U)
                        {
                            printf("[OTEST] recovery timeout\n");
                            break;
                        }
                    }
                }
                if (UsbMscService_IsReady() != 0U)
                {
                    (void)UsbFsService_Mount();
                }
            }
        }

        if (result != USB_FS_RESULT_OK)
        {
            printf("[OTEST] read FAILED at offset=%lu\n", (unsigned long)offset);
            return;
        }

        /* Program chunk into OSPI flash */
        ospi_result = BootOspi_Program(offset, chunk, bytes_read);
        if (ospi_result != BOOT_OSPI_OK)
        {
            printf("[OTEST] program FAILED at offset=%lu result=%u\n",
                   (unsigned long)offset, (unsigned int)ospi_result);
            return;
        }

        offset += bytes_read;
        block_num++;

        printf("[OTEST] %lu / %lu bytes (%lu%%)\n",
               (unsigned long)offset,
               (unsigned long)file_size,
               (unsigned long)((offset * 100U) / file_size));

        if (offset < file_size)
        {
            HAL_Delay(CHUNKED_READ_INTER_BLOCK_DELAY_MS);
        }
    }

    uint32_t elapsed = HAL_GetTick() - t_start;

    /* 5. Switch to memory-mapped mode and verify CRC32 directly from mapped address */
    if (BootOspi_EnableMemoryMapped() != BOOT_OSPI_OK)
    {
        printf("[OTEST] memory-mapped FAILED, cannot verify\n");
        return;
    }

    {
        uint32_t crc_flash;
        uint32_t t_crc = HAL_GetTick();

        printf("[OTEST] verifying CRC32 over memory-mapped OSPI (0x%08lX, %lu bytes)...\n",
               (unsigned long)OCTOSPI1_BASE, (unsigned long)file_size);

        crc_flash = crc32_update(0U, (const uint8_t *)OCTOSPI1_BASE, file_size);

        /* Deinit CRC peripheral and re-enable memory-mapped before jumping */
        HAL_CRC_DeInit(&hcrc);
        __HAL_RCC_CRC_CLK_DISABLE();
        hcrc_initialized = 0U;

        /* Re-establish memory-mapped mode after bulk read */
        HAL_OSPI_Abort(BootOspi_GetHandle());
        if (BootOspi_EnableMemoryMapped() != BOOT_OSPI_OK)
        {
            printf("[OTEST] re-enable memory-mapped FAILED\n");
        }

        printf("[OTEST] OSPI CRC32=%08lX  expected=%08lX  %s  (%lu ms)\n",
               (unsigned long)crc_flash,
               (unsigned long)expected_crc32,
               (crc_flash == expected_crc32) ? "MATCH" : "MISMATCH",
               (unsigned long)(HAL_GetTick() - t_crc));
    }

    printf("[OTEST] done in %lu ms\n", (unsigned long)elapsed);

